<!DOCTYPE html>
<html>
<head>
    <title>Setting up database</title>
    <script src="../javascript/md5.min.js"></script>
</head>
<body>
    <h3>Setting up...</h3>

<?php 
  	$dbhost  = 'localhost';   //изменит здесь по неоходимости 
  	$dbuser  = 'root';   //изменить здесь по необходимости
  	$dbpass  = '';   //изменить здесь по необходимости
  	$dbname  = 'airlife'; 
	
	$connection = new mysqli($dbhost, $dbuser, $dbpass);
	if ($connection->connect_error) die($connection->connect_error);

	function createDatabase($name)
	{     
	    queryMysql("CREATE DATABASE IF NOT EXISTS $name DEFAULT CHARACTER SET utf8 COLLATE utf8_general_ci");    
	    echo "Database '$name' created or already exists.<br>";
	}

	function useDatabase($dbname)
	{              
		queryMysql("USE $dbname");
	    echo "Database '$dbname' selected and use.<br>";
	}

	function createTable($name, $query, $engine)
	{
	    queryMysql("CREATE TABLE IF NOT EXISTS $name($query) $engine COLLATE utf8_general_ci DEFAULT CHARSET utf8;");
	    echo "Table '$name' created or already exists.<br>";
	}

	function queryMysql($query)
	{
	    global $connection;
	    $result = $connection->query($query);
	    if (!$result) die($connection->error);
	    return $result;
	}

	queryMysql("SET NAMES 'utf8'"); 
	queryMysql("SET CHARACTER SET 'utf8'"); 
	queryMysql("SET SESSION collation_connection = 'utf8_general_ci'"); 

	createDatabase($dbname);
	useDatabase($dbname);

	createTable('airplanes',				
				'airplane_type VARCHAR(16),
				count_economy SMALLINT UNSIGNED,
				count_standard SMALLINT UNSIGNED,
				count_business SMALLINT UNSIGNED,
				
				PRIMARY KEY (airplane_type)',
				'ENGINE MyISAM');

	createTable("flights", 				
				'flight_number BIGINT UNSIGNED,
				flight_from VARCHAR(32) COLLATE utf8_general_ci,
				flight_to VARCHAR(32) COLLATE utf8_general_ci,
				flight_from_code VARCHAR(4), 
				flight_to_code VARCHAR(4),
				time_up TIME,
				time_down TIME,
				time_flight TIME,
				airplane_type VARCHAR(16),
				price_economy INT UNSIGNED,  
				price_standard INT UNSIGNED,
				price_business INT UNSIGNED,
				popular INT DEFAULT 0, 
				
				PRIMARY KEY (flight_number), 
				INDEX (flight_from (16)), 
				INDEX (flight_to(16)),
				INDEX (flight_from_code(4)),
				INDEX (flight_to_code(4))',
				'ENGINE MyISAM');

	createTable('schedule',
				'flight_number VARCHAR(16) NOT NULL, 
				flight_date DATE NOT NULL, 
				time_up TIME,
				time_down TIME,
				price_economy INT UNSIGNED,  
				price_standard INT UNSIGNED,
				price_business INT UNSIGNED,
				buy_economy SMALLINT DEFAULT 0, 
				buy_standard SMALLINT DEFAULT 0,
				buy_business SMALLINT DEFAULT 0,	
				flight_status VARCHAR(16),
				id_schedule INT UNSIGNED NOT NULL AUTO_INCREMENT,
				
				INDEX (flight_date), 
				PRIMARY KEY (id_schedule),
				INDEX (flight_number(8))',
				'ENGINE MyISAM');

	createTable('users',
				'user_id INT UNSIGNED NOT NULL AUTO_INCREMENT,
				username VARCHAR(32) NOT NULL UNIQUE,
				password CHAR(128) NOT NULL,
				email CHAR(32) NOT NULL,
				time BIGINT UNSIGNED,

				INDEX (username(16)),			
				PRIMARY KEY (user_id)',
				'ENGINE MyISAM');

	createTable('admins',
				'user_id INT UNSIGNED NOT NULL AUTO_INCREMENT,
				username VARCHAR(32) NOT NULL UNIQUE,
				password CHAR(128) NOT NULL,				
				time BIGINT UNSIGNED,

				INDEX (username(16)),			
				PRIMARY KEY (user_id)',
				'ENGINE MyISAM');

	$password = md5(md5('adminA1234'));
	queryMysql("INSERT INTO admins (username, password) VALUES ('admin', '$password')"); 

	createTable('customers',
				'user_id INT UNSIGNED NOT NULL UNIQUE,
				first_name VARCHAR(32),
				last_name VARCHAR(32),
				birthday DATE, 
				sex VARCHAR (14),
				document_type VARCHAR (16), 
				document_number VARCHAR (16),

				PRIMARY KEY (user_id)',
			 	'ENGINE MyISAM');

	//createTable('customer_tickets',
	//			'user_id INT UNSIGNED UNIQUE, 
	//			ticket_number INT UNSIGNED UNIQUE, 
	//			purchase_date DATE,
	//
	//			INDEX (user_id), 
	//			INDEX (ticket_number)',
	//			'ENGINE MyISAM');

	createTable('tickets',
				'ticket_number INT UNSIGNED NOT NULL AUTO_INCREMENT,
				user_id INT UNSIGNED NOT NULL,
				purchase_date DATE,
				flight_number VARCHAR(16),
				flight_date DATE,
				time_up TIME,
				time_down TIME,
				time_flight TIME,
				class VARCHAR (16),
				price INT UNSIGNED,	
				first_name VARCHAR(32),
				last_name VARCHAR(32),
				birthday DATE,  
				sex VARCHAR (16),
				document_type VARCHAR (16), 
				document_number BIGINT UNSIGNED,
				
				PRIMARY KEY (ticket_number),
				INDEX (user_id)',
    			'AUTO_INCREMENT = 1234 ENGINE MyISAM');

	createTable('airports',
				'sity VARCHAR(32),
				 airport_code_eng VARCHAR(3), 
				 airport_code_rus VARCHAR(4),
				 airport_name VARCHAR(32),
				
				 INDEX (airport_code_eng(3)),
				 INDEX (sity(20))',

    			'ENGINE MyISAM');


	queryMysql("INSERT INTO `airlife`.`flights` (`flight_number`, `flight_from`, `flight_to`, `flight_from_code`, `flight_to_code`, `time_up`, `time_down`, `time_flight`, `airplane_type`, `price_economy`, `price_standard`, `price_business`) VALUES 
				('23', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '18:55:00', '20:30:00', '01:35:00', 'A320', '6000', '12895', '18550'),
				('37', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '00:55:00', '02:35:00', '01:40:00', 'A320', '2000', '12895', '18550'),
				('47', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '07:45:00', '09:25:00', '01:40:00', 'A320', '3000', '12895', '18550'),
				('45', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '10:15:00', '11:55:00', '01:40:00', 'A320', '4000', '12895', '18550'),
				('49', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '14:55:00', '16:35:00', '01:40:00', 'A320', '5000', '12895', '18550'),
				('43', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '17:50:00', '19:30:00', '01:40:00', 'A320', '1000', '12895', '18550'),
				('41', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '20:35:00', '22:15:00', '01:40:00', 'A320', '4775', '12895', '18550'),
				('39', 'Москва', 'Санкт-Петербург', 'DME', 'LED', '12:00:00', '13:45:00', '01:45:00', 'A320', '4775', '12895', '18550'),
				('50', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '17:15:00', '18:50:00', '01:35:00', 'A320', '4775', '12895', '18550'),
				('24', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '21:10:00', '22:45:00', '01:35:00', 'A320', '4775', '12895', '18550'),
				('38', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '05:20:00', '07:00:00', '01:40:00', 'A320', '6000', '12895', '18550'),
				('48', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '10:05:00', '11:45:00', '01:40:00', 'A320', '2000', '12895', '18550'),
				('46', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '12:35:00', '14:15:00', '01:40:00', 'A320', '3000', '12895', '18550'),
				('40', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '14:25:00', '16:05:00', '01:40:00', 'A320', '4000', '12895', '18550'),
				('44', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '20:10:00', '21:50:00', '01:40:00', 'A320', '5000', '12895', '18550'),
				('42', 'Санкт-Петербург', 'Москва', 'LED', 'DME', '22:55:00', '00:35:00', '01:40:00', 'A320', '1000', '12895', '18550'),
				('1045', 'Москва', 'Сочи', 'DME', 'AER', '10:15:00', '12:40:00', '02:25:00', 'A320', '7985', '21405', '25000'), 	
				('1023', 'Москва', 'Сочи', 'DME', 'AER', '13:15:00', '15:40:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1027', 'Москва', 'Сочи', 'DME', 'AER', '17:00:00', '19:25:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1021', 'Москва', 'Сочи', 'DME', 'AER', '23:30:00', '01:55:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1022', 'Сочи', 'Москва', 'AER', 'DME', '05:20:00', '07:45:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1046', 'Сочи', 'Москва', 'AER', 'DME', '13:25:00', '15:50:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1024', 'Сочи', 'Москва', 'AER', 'DME', '16:50:00', '19:15:00', '02:25:00', 'A320', '7985', '21405', '25000'),
				('1028', 'Сочи', 'Москва', 'AER', 'DME', '20:10:00', '22:35:00', '02:25:00', 'A320', '7985', '21405', '25000'), 
				('31', 'Москва', 'Самара', 'DME', 'KUF', '12:05:00', '14:45:00', '01:40:00', 'A320', '6100', '15530', '22755'),
				('33', 'Москва', 'Самара', 'DME', 'KUF', '07:40:00', '10:25:00', '01:45:00', 'A320', '6100', '15530', '22755'),
				('35', 'Москва', 'Самара', 'DME', 'KUF', '19:00:00', '21:45:00', '01:45:00', 'A320', '6100', '15530', '22755'),
				('29', 'Москва', 'Самара', 'DME', 'KUF', '23:50:00', '02:35:00', '01:45:00', 'A320', '6100', '15530', '22755'),
				('30', 'Самара', 'Москва', 'KUF', 'DME', '06:15:00', '07:05:00', '01:50:00', 'A320', '6100', '15530', '22755'),
				('34', 'Самара', 'Москва', 'KUF', 'DME', '11:15:00', '12:05:00', '01:50:00', 'A320', '6100', '15530', '22755'),
				('32', 'Самара', 'Москва', 'KUF', 'DME', '15:35:00', '16:25:00', '01:50:00', 'A320', '6100', '15530', '22755'),
				('36', 'Самара', 'Москва', 'KUF', 'DME', '22:35:00', '23:25:00', '01:50:00', 'A320', '6100', '15530', '22755'),
				('179', 'Москва', 'Новосибирск', 'DME', 'OVB', '11:15:00', '18:25:00', '04:10:00', 'A320', '12890', '34445', '34500'),
				('181', 'Москва', 'Новосибирск', 'DME', 'OVB', '17:30:00', '00:40:00', '04:10:00', 'A320', '12890', '34445', '34500'),
				('173', 'Москва', 'Новосибирск', 'DME', 'OVB', '21:55:00', '05:05:00', '04:10:00', 'A320', '12890', '34445', '34500'),
				('177', 'Москва', 'Новосибирск', 'DME', 'OVB', '23:35:00', '06:45:00', '04:10:00', 'A320', '12890', '34445', '34500'),
				('178', 'Новосибирск', 'Москва', 'OVB', 'DME', '06:20:00', '07:55:00', '04:35:00', 'A320', '12890', '34445', '34500'),
				('174', 'Новосибирск', 'Москва', 'OVB', 'DME', '07:40:00', '09:15:00', '04:35:00', 'A320', '12890', '34445', '34500'),
				('182', 'Новосибирск', 'Москва', 'OVB', 'DME', '14:30:00', '16:05:00', '04:35:00', 'A320', '12890', '34445', '34500'),
				('176', 'Новосибирск', 'Москва', 'OVB', 'DME', '19:15:00', '20:50:00', '04:35:00', 'A320', '12890', '34445', '34500'),
				('53', 'Москва', 'Екатеринбург', 'DME', 'SVX', '08:40:00', '13:00:00', '02:20:00', 'A320', '8375', '23515', '16300'),
				('55', 'Москва', 'Екатеринбург', 'DME', 'SVX', '14:50:00', '19:10:00', '02:20:00', 'A320', '8375', '23515', '16300'),
				('59', 'Москва', 'Екатеринбург', 'DME', 'SVX', '18:00:00', '22:20:00', '02:20:00', 'A320', '8375', '23515', '16300'),
				('51', 'Москва', 'Екатеринбург', 'DME', 'SVX', '23:35:00', '03:55:00', '02:20:00', 'A320', '8375', '23515', '16300'),
				('52', 'Екатеринбург', 'Москва', 'SVX', 'DME', '06:20:00', '06:55:00', '02:35:00', 'A320', '8375', '23515', '16300'),
				('54', 'Екатеринбург', 'Москва', 'SVX', 'DME', '13:40:00', '14:15:00', '02:35:00', 'A320', '8375', '23515', '16300'),
				('56', 'Екатеринбург', 'Москва', 'SVX', 'DME', '19:50:00', '20:25:00', '02:35:00', 'A320', '8375', '23515', '16300'),
				('60', 'Екатеринбург', 'Москва', 'SVX', 'DME', '23:00:00', '23:35:00', '02:35:00', 'A320', '8375', '23515', '16300'),
				('772', 'Москва', 'Иркутск', 'DME', 'IKT', '18:40:00', '05:00:00', '05:20:00', 'A320', '15560', '41530', '49000'),
				('778', 'Москва', 'Иркутск', 'DME', 'IKT', '21:25:00', '08:05:00', '05:40:00', 'A320', '15560', '41530', '49000'),
				('776', 'Москва', 'Иркутск', 'DME', 'IKT', '22:50:00', '09:30:00', '05:40:00', 'A320', '15560', '41530', '49000'),
				('771', 'Иркутск', 'Москва', 'IKT', 'DME', '06:20:00', '07:40:00', '06:20:00', 'A320', '15460', '41530', '49000'),
				('777', 'Иркутск', 'Москва', 'IKT', 'DME', '09:35:00', '11:00:00', '06:25:00', 'A320', '15460', '41530', '49000'),
				('773', 'Иркутск', 'Москва', 'IKT', 'DME', '10:50:00', '12:15:00', '06:25:00', 'A320', '15460', '41530', '49000')
				");

				
	$date_begin = date("Y-m-d");
	$date_end = date('Y-m-d', strtotime($date_begin.' + 1 year'));	
	$date = $date_begin;
	while($date <= $date_end)
	{    

		queryMysql("INSERT INTO `airlife`.`schedule` (`flight_number`, `flight_date`) VALUES 
				('23'		,	'$date'),						
				('37'		, 	'$date'),	
				('47'		, 	'$date'),	
				('45'		, 	'$date'),	
				('49'		, 	'$date'),	
				('43'		, 	'$date'),	
				('41'		, 	'$date'),	
				('39'		, 	'$date'),	
				('50'		, 	'$date'),	
				('24'		, 	'$date'),	
				('38'		, 	'$date'),	
				('48'		, 	'$date'),	
				('46'		, 	'$date'),	
				('40'		, 	'$date'),	
				('44'		, 	'$date'),	
				('42'		, 	'$date'),	
				('1045'	,	'$date'),	
				('1023'	,	'$date'),	
				('1027'	,	'$date'),	
				('1021'	,	'$date'),	
				('1022'	,	'$date'),	
				('1046'	,	'$date'),	
				('1024'	,	'$date'),	
				('1028'	,	'$date'),	
				('31'		, 	'$date'),	
				('33'		, 	'$date'),	
				('35'		, 	'$date'),	
				('29'		, 	'$date'),	
				('30'		, 	'$date'),	
				('34'		, 	'$date'),	
				('32'		, 	'$date'),	
				('36'		, 	'$date'),	
				('179'	,	'$date'),	
				('181'	,	'$date'),	
				('173'	,	'$date'),	
				('177'	,	'$date'),	
				('178'	,	'$date'),	
				('174'	,	'$date'),	
				('182'	,	'$date'),	
				('176'	,	'$date'),	
				('53'		, 	'$date'),	
				('55'		, 	'$date'),	
				('59'		, 	'$date'),	
				('51'		, 	'$date'),	
				('52'		, 	'$date'),	
				('54'		, 	'$date'),	
				('56'		, 	'$date'),	
				('60'		, 	'$date'),	
				('772'	,	'$date'),	
				('778'	,	'$date'),	
				('776'	,	'$date'),	
				('771'	,	'$date'),	
				('777'	,	'$date'),	
				('773'	,	'$date')");	
  
    	$date = date('Y-m-d', strtotime($date.' + 1 days'));
    }

	queryMysql("INSERT INTO `airlife`.`airports` (`sity`, `airport_code_eng`, `airport_code_rus`, `airport_name`) VALUES 	
				('Абакан (Хакасия)','ABA','АБН','Абакан'),
				('Айхал (Якутия)','','АХЛ','Айхал'),
				('Алдан (Якутия)','ADH','АЛД','Алдан'),
				('Амдерма (Ненецкий АО)','AMV','АМД','Амдерма'),
				('Анадырь (Чукотский АО) ','DYR','АНЫ','Угольный'),
				('Анапа (Краснодарский край)','AAQ','АНА','Витязево'),
				('Апатиты (Мурманская область)','KVK','АПХ','Апатиты-Кировск'),
				('Архангельск (Архангельская область)','','ВСЬ','Васьково (МВЛ)'),
				('Архангельск (Архангельская область)','ARH','АРХ','Талаги'),
				('Астрахань (Астраханская область)','ASF','АСР','Астрахань'),
				('Ачинск (Красноярский край)','ACS','АЧН','Ачинск'),
				('Аян (Хабаровский край) ','','АЯН','Аян (Мунук)'),
				('Багдарин (Бурятия)','','','Багдарин'),
				('Байконур (Казахстан)','','ЛНЙ','Байконур (Крайний)'),
				('Барнаул (Алтайский край)','BAX','БАН','Барнаул'),
				('Белая Гора (Якутия)','BGN','','Белая Гора'),
				('Белгород (Белгородская область)','EGO','БЕД','Белгород'),
				('Белоярский (Ханты-Мансийский автономный округ)','EYK','БЛР','Белоярский'),
				('Берёзово (Ханты-Мансийский автономный округ)','EZV','БЕР','Берёзово'),
				('Беринговский (Чукотский АО)','','БНГ','Беринговский'),
				('Билибино (Чукотский АО)','','КПМ','Кепервеем'),
				('Благовещенск (Амурская область)','BQS','БГЩ','Игнатьево'),
				('Богородское (Хабаровский край)','BQG','БГР','Богородское'),
				('Бор (Красноярский край)','','ПТС','Подкаменная Тунгуска'),
				('Братск (Иркутская область)','BTK','БРС','Братск'),
				('Брянск (Брянская область)','BZK','БРЯ','Брянск'),
				('Бугульма (Татарстан)','UUA','БУГ','Бугульма'),
				('Бугуруслан (Оренбургская область)','','БГГ','Бугуруслан (Главный)'),
				('Варандей (Ненецкий АО)','VRI','ВРЙ','Варандей'),
				('Великие Луки (Псковская область)','VLU','ВЕК','Великие Луки'),
				('Великий Устюг (Вологодская область)','VUS','ВЕУ','Великий Устюг'),
				('Витим (Якутия)','TLK','','Талакан'),
				('Владивосток (Приморский край)','VVO','ВВО','Кневичи'),
				('Владикавказ (Северная Осетия)','OGZ','ВЛА','Беслан'),
				('Владимир (Владимирская область)','','ВЛМ','Семязино (МВЛ)'),
				('Волгоград (Волгоградская область)','VOG','ВГГ','Гумрак'),
				('Вологда (Вологодская область)','VGD','ВГД','Вологда'),
				('Воркута (Коми)','VKT','ВКТ','Воркута'),
				('Воронеж (Воронежская область)','','','Придача'),
				('Воронеж (Воронежская область)','VOZ','ВРН','Чертовицкое'),
				('Вуктыл','','','Вуктыл'),
				('Геленджик (Краснодарский край)','GDZ','ГДЖ','Геленджик'),
				('Горно-Алтайск (Алтай)','RGK','ГОР','Горно-Алтайск'),
				('Грозный (Чечня)','GRV','ГРН','Грозный (аэропорт)'),
				('Диксон (Красноярский край)','DKS','ДИК','Диксон'),
				('Екатеринбург (Свердловская область)','SVX','КЛЦ','Кольцово'),
				('Екатеринбург (Свердловская область)','','УКС','Уктус (МВЛ)'),
				('Енисейск (Красноярский край)','EIE','ЕНС','Енисейск'),
				('Жиганск (Якутия)','','ЖИГ','Жиганск'),
				('Зея (Амурская область)','','ЗЕЯ','Зея'),
				('Иваново (Ивановская область)','IWA','ИВВ','Иваново-Южный'),
				('Игарка (Красноярский край)','IAA','ИГР','Игарка'),
				('Игрим','IRM','','Игрим'),
				('Ижевск (Удмуртия)','IJK','ИЖВ','Ижевск'),
				('Инта (Коми)','INA','ИНТ','Инта'),
				('Иркутск (Иркутская область)','IKT','ИКТ','Иркутск'),
				('Итуруп (Сахалинская область)','','','Итуруп'),
				('Йошкар-Ола (Марий Эл)','JOK','ИШО','Йошкар-Ола'),
				('Казань (Татарстан)','KZN','КЗН','Казань'),
				('Калининград (Калининградская область)','KGD','КЛД','Храброво'),
				('Каратайка (Ненецкий АО)','','КТЙ','Каратайка'),
				('Кемерово (Кемеровская область)','KEJ','КРВ','Кемерово'),
				('Киров (Кировская область)','KVX','КИО','Победилово'),
				('Когалым (Ханты-Мансийский АО)','KGP','КОГ','Когалым'),
				('Комсомольск-на-Амуре (Хабаровский край)','','','Дзёмги'),
				('Комсомольск-на-Амуре (Хабаровский край)','KXK','КСЛ','Хурба'),
				('Костомукша (Карелия)','','','Костомукша (МВЛ)'),
				('Кострома (Костромская область)','KMW','КОР','Сокеркино'),
				('Котлас (Архангельская область)','KSZ','КТС','Котлас'),
				('Краснодар (Краснодарский край)','KRR','КПА','Пашковский'),
				('Краснодар (Краснодарский край)','','ЭНЕ','Энем (МВЛ)'),
				('Краснокаменск (Забайкальский край)','','КНК','Краснокаменск'),
				('Красноярск (Красноярский край)','KJA','ЕМВ','Емельяново'),
				('Красноярск (Красноярский край)','','КЯС','Черемшанка (МВЛ)'),
				('Красный Кут (Саратовская область)','','КСЫ','Красный Кут'),
				('Курган (Курганская область)','KRO','КГН','Курган'),
				('Курильск','BVV','','Буревестник'),
				('Курск (Курская область)','URS','КУС','Восточный'),
				('Кызыл (Тыва)','KYZ','КЫЫ','Кызыл'),
				('Лешуконское (Архангельская область)','LDG','ЛЕШ','Лешуконское'),
				('Липецк (Липецкая область)','LPK','ЛИП','Липецк'),
				('Магадан (Магаданская область)','','МГД','Магадан-13'),
				('Магадан (Магаданская область)','GDX','МДС','Сокол'),
				('Магдагачи (Амурская область)','GDG','МДЧ','Магдагачи'),
				('Магнитогорск (Челябинская область)','MQF','МГС','Магнитогорск'),
				('Махачкала (Дагестан)','MCX','МХЛ','Уйташ'),
				('Мезень (Архангельская область)','','МЗН','Мезень'),
				('Минеральные Воды (Ставропольский край)','MRV','МРВ','Минеральные Воды'),
				('Мирный (Якутия)','MJZ','МИР','Мирный'),
				('Москва','VKO','ВНК','Внуково'),
				('Москва','DME','ДМД','Домодедово'),
				('Москва','','ОСФ','Остафьево'),
				('Москва','','РНЦ','Раменское'),
				('Москва','SVO','ШРМ','Шереметьево'),
				('Мурманск (Мурманская область)','MMK','МУН','Мурманск'),
				('Мыс Шмидта (Чукотский АО)','','МШД','Мыс Шмидта'),
				('Надым (Ямало-Ненецкий АО)','NYM','НДМ','Надым'),
				('Назрань','IGT','ИНШ','Магас'),
				('Нальчик (Кабардино-Балкария)','NAL','НЧК','Нальчик'),
				('Нарьян-Мар (Ненецкий АО)','NNM','ННР','Нарьян-Мар'),
				('Нелькан (Хабаровский край)','','НЛН','Нелькан'),
				('Нерюнгри (Якутия)','NER','НРГ','Чульман'),
				('Нижнеангарск (Бурятия)','','ИЖГ','Нижнеангарск'),
				('Нижневартовск (Ханты-Мансийский АО)','NJC','НЖВ','Нижневартовск'),
				('Нижнекамск (Татарстан)','NBC','НЖК','Бегишево'),
				('Нижний Новгород (Нижегородская область)','GOJ','НЖС','Стригино'),
				('Николаевск-на-Амуре (Хабаровский край)','NLI','НЛК','Николаевск-на-Амуре'),
				('Никольское (Камчатский край)','','НИК','Никольское'),
				('Новокузнецк (Кемеровская область)','NOZ','НВК','Спиченково'),
				('Новосибирск (Новосибирская область)','','НВЦ','Ельцовка'),
				('Новосибирск (Новосибирская область)','OVB','ТЛЧ','Толмачёво'),
				('Новый Уренгой (Ямало-Ненецкий АО)','NUX','НУР','Новый Уренгой'),
				('Ноглики (Сахалинская область)','NGL','НГЛ','Ноглики'),
				('Норильск (Красноярский край)','NSK','НАК','Алыкель'),
				('Ноябрьск (Ямало-Ненецкий АО)','NOJ','НОЯ','Ноябрьск'),
				('Нюксеница','','НЮК','Нюксеница'),
				('Нягань (Ханты-Мансийский АО)','NYA','НЯГ','Аэропорт Нягань'),
				('Октябрьский (Башкортостан)','OKT','ОКТ','Октябрьский'),
				('Омск (Омская область)','','ОМВ','Омск-Северный'),
				('Омск (Омская область)','OMS','ОМС','Омск-Центральный'),
				('Онега (Архангельская область)','','ОНА','Онега'),
				('Оренбург (Оренбургская область)','REN','ОНГ','Оренбург-Центральный'),
				('Орск (Оренбургская область)','OSW','ОСК','Орск'),
				('Оха (Сахалинская область)','OHH','ОХА','Оха'),
				('Охотск (Хабаровский край)','OHO','ОХТ','Охотск'),
				('Певек (Чукотский АО)','PWE','ПЕВ','Певек'),
				('Пенза (Пензенская область)','PEZ','ПНА','Пенза'),
				('Пермь (Пермский край)','PEE','ПРЬ','Большое Савино'),
				('Петрозаводск (Карелия)','PES','ПТБ','Бесовец'),
				('Петрозаводск (Карелия)','','ПТД','Пески'),
				('Петропавловск-Камчатский (Камчатский край)','PKC','ПРЛ','Елизово'),
				('Печора (Коми)','PEX','ПЧР','Печора'),
				('Провидения (Чукотский АО)','PVS','ПРД','Бухта Провидения'),
				('Псков (Псковская область)','PKV','ПСК','Псков'),
				('Пушкин (Санкт-Петербург)','','ПШН','Пушкин'),
				('Ростов-на-Дону (Ростовская область)','ROV','РОВ','Ростов-на-Дону'),
				('Рыбинск (Ярославская область)','RYB','РБН','Староселье'),
				('Сабетта (Ямало-Ненецкий АО)','','','Сабетта'),
				('Салехард (Ямало-Ненецкий АО)','SLY','СХД','Салехард'),
				('Самара (Самарская область)','KUF','СКЧ','Курумоч'),
				('Санкт-Петербург','LED','ПЛК','Пулково'),
				('Саранск','SKX','СРН','Саранск'),
				('Саратов (Саратовская область)','RTW','СРО','Саратов-Центральный'),
				('Севастополь','UKS','СВС','Бельбек'),
				('Сибай (Республика Башкортостан)','','','Сибай (аэропорт)'),
				('Симферополь (Республика Крым)','SIP','СИМ','Симферополь (аэропорт)'),
				('Советская Гавань (Хабаровский край)','GVN','СОГ','Май-Гатка'),
				('Советский (Ханты-Мансийский автономный округ)','OVS','СОЙ','Советский '),
				('Соловецкие острова (Архангельская область)','CSH','СОИ','Соловки'),
				('Сочи (Краснодарский край)','AER','СОЧ','Адлер-Сочи'),
				('Ставрополь (Ставропольский край)','STW','СТВ','Шпаковское'),
				('Старый Оскол (Белгородская область)','','СОЛ','Старый Оскол'),
				('Стерлитамак (Башкортостан)','','СТМ','Стерлитамак'),
				('Сунтар (Якутия)','SUY','СУН','Сунтар'),
				('Сургут (Ханты-Мансийский АО-Югра)','SGC','СУР','Сургут'),
				('Сыктывкар (Коми)','SCW','СЫВ','Сыктывкар'),
				('Таганрог (Ростовская область)','TGK','ТАГ','Таганрог-Южный'),
				('Тамбов (Тамбовская область)','TBW','ТМБ','Донское'),
				('Тарко-Сале (Ямало-Ненецкий АО)','TQL','ТКС',''),
				('Тверь (Тверская область)','','ТРЬ','Змеёво (МВЛ)'),
				('Тверь (Тверская область)','KLD','ТВГ','Мигалово'),
				('Тикси','IKS','ТСИ','Тикси'),
				('Тиличики (Камчатский край)','','ТИЛ','Тиличики'),
				('Томск (Томская область)','TOF','ТСК','Богашёво'),
				('Тура (Красноярский край)','','ТАУ','Горный'),
				('Тында (Амурская область)','TYD','ТЫД','Тында'),
				('Тюмень (Тюменская область)','','ПЛХ','Плеханово (МВЛ)'),
				('Тюмень (Тюменская область)','TJM','РЩН','Рощино'),
				('Удачный (Якутия)','PYJ','ПЛЯ','Полярный'),
				('Улан-Удэ (Бурятия)','UUD','УЛЭ','Улан-Удэ (Мухино)'),
				('Улан-Удэ (Бурятия)','','','Улан-Удэ (Восточный)'),
				('Ульяновск (Ульяновская область)','ULV','УЛК','Ульяновск (Баратаевка)'),
				('Ульяновск (Ульяновская область)','ULY','УЛС','Ульяновск (Восточный)'),
				('Урай','URJ','','Урай'),
				('Усть-Куйга (Якутия)','UKG','УКУ','Усть-Куйга'),
				('Усть-Кут (Иркутская область)','UKX','УСК','Усть-Кут'),
				('Усть-Нера (Якутия)','','УНР','Усть-Нера'),
				('Усинск','USK','','Усинск'),
				('Уфа (Башкортостан)','UFA','УФА','Уфа'),
				('Ухта (Коми)','UCT','УХТ','Ухта'),
				('Хабаровск (Хабаровский край)','','ХБА','Хабаровск (МВЛ)'),
				('Хабаровск (Хабаровский край)','KHV','ХБР','Хабаровск-Новый'),
				('Хандыга (Якутия)','KDY','ХДЫ','Хандыга (Теплый ключ)'),
				('Ханты-Мансийск (Ханты-Мансийский АО)','HMA','ХАС','Ханты-Мансийск'),
				('Харута (Ненецкий АО)','','ХАУ','Харута'),
				('Хатанга (Красноярский край)','HTG','ХАТ','Хатанга'),
				('Херпучи (Хабаровский край)','','ХРТ','Херпучи'),
				('Чара (Читинская область)','','ЧАР','Чара'),
				('Чебоксары (Чувашия)','CSY','ЧБЕ','Чебоксары'),
				('Челябинск (Челябинская область)','CEK','ЧЛБ','Челябинск'),
				('Череповец (Вологодская область)','CEE','ЧРВ','Череповец'),
				('Черский (Якутия)','CYX','ЧРС','Черский'),
				('Чита (Читинская область)','HTA','СХТ','Кадала'),
				('Чокурдах (Якутия)','CKH','ЧКД','Чокурдах'),
				('Чумикан (Хабаровский край)','','ЧМИ','Чумикан'),
				('Шахтерск (Сахалинская область)','EKS','ШАХ','Шахтёрск'),
				('Щёлково (Московская область)','CKL','','Чкаловский'),
				('Экимчан (Амурская область)','','ЭМП','Экимчан'),
				('Элиста (Калмыкия)','ESL','ЭЛИ','Элиста'),
				('Южно-Курильск (Сахалинская область)','DEE','ЮЖК','Менделеево'),
				('Южно-Сахалинск (Сахалинская область)','UUS','ЮЖХ','Хомутово'),
				('Якутск (Якутия)','YKS','ЯКТ','Якутск'),
				('Ямбург (Ямало-Ненецкий АО)','','ЯМБ','Ямбург'),
				('Ярославль (Ярославская область)','','ЯРВ','Левцово'),
				('Ярославль (Ярославская область)','IAR','ЯРТ','Туношна')");


?>

	<br>...done.
</body>
</html>